/**
 * Created by linpengteng on 2017/5/17.
 */

'use strict';

define(function(){

    return {
        "success":true,
        "msg":null,
        "obj":{
            showCont:[
                {
                    contTypeTitle: "食品饮料",
                    showContItemList:[
                        {
                            title: "进口食品",
                            content: {
                                "休闲零食1": "#休闲零食1",
                                "饼干蛋糕": "#饼干蛋糕",
                                "橄榄油": "#饮料",
                                "坚果蜜饯": "#坚果蜜饯",
                                "糖果/巧克力": "#糖果-巧克力",
                                "进口牛奶": "#进口牛奶",
                                "方便食品": "#方便食品",
                                "饮料冲调": "#饮料冲调"
                            }
                        },
                        {
                            title: "休闲食品",
                            content: {
                                "进口食品": "#进口食品",
                                "猪肉脯": "#猪肉脯",
                                "薯片/膨化": "#薯片-膨化",
                                "鸭脖": "#鸭脖",
                                "海苔": "#海苔",
                                "牛肉干": "#牛肉干",
                                "果蔬干": "#果蔬干",
                                "果冻": "#果冻",
                                "辣条": "#辣条"
                            }
                        },
                        {
                            title: "蛋糕饼干",
                            content: {
                                "进口饼干": "#进口饼干",
                                "曲奇": "#曲奇",
                                "面包": "#面包",
                                "蛋糕饼干": "#蛋糕饼干",
                                "派蛋卷": "#派蛋卷",
                                "威化": "#威化",
                                "肉松饼": "#肉松饼"
                            }
                        },
                        {
                            title: "坚果炒货",
                            content: {
                                "坚果炒货": "#坚果炒货",
                                "瓜子": "#瓜子",
                                "核桃": "#核桃",
                                "夏威夷果": "#夏威夷果",
                                "松子": "#松子",
                                "开心果": "#开心果",
                                "碧根果": "#碧根果",
                                "腰果": "#腰果",
                                "花生": "#花生",
                            }
                        },
                        {
                            title: "蜜饯果干",
                            content: {
                                "枣夹核桃": "#枣夹核桃",
                                "枣": "#枣",
                                "葡萄干": "#葡萄干",
                                "芒果干": "#芒果干",
                                "梅": "#梅",
                                "山楂": "#山楂",
                                "枸杞": "#枸杞",
                                "蔓越莓干": "#蔓越莓干",
                                "栗子薯/芋头类": "#栗子薯-芋头类",
                            }
                        },
                        {
                            title: "糖果/巧克力",
                            content: {
                                "进口巧克力": "#进口巧克力",
                                "巧克力": "#巧克力",
                                "口香糖": "#口香糖",
                                "棒棒糖": "#棒棒糖",
                                "喜糖": "#喜糖",
                                "糖": "#糖",
                                "润喉糖": "#润喉糖",
                                "黑巧克力": "#黑巧克力"
                            }
                        },
                        {
                            title: "牛奶",
                            content: {
                                "进口牛奶": "#进口牛奶",
                                "牛奶乳品": "#牛奶乳品",
                                "酸奶": "#酸奶",
                                "风味奶": "#风味奶",
                                "儿童奶": "#儿童奶",
                                "鲜奶": "#鲜奶",
                                "成人奶粉": "#成人奶粉",
                                "乳酸饮料": "#乳酸饮料"
                            }
                        },
                        {
                            title: "茗茶",
                            content: {
                                "铁观音": "#铁观音",
                                "乌龙茶": "#乌龙茶",
                                "龙井": "#龙井",
                                "普洱": "#普洱",
                                "红茶": "#红茶",
                                "绿茶": "#绿茶",
                                "白茶": "#白茶",
                                "黑茶": "#黑茶",
                                "养生茶": "#养生茶",
                                "花果茶": "#花果茶",
                                "花草茶": "#花草茶"
                            }
                        },
                        {
                            title: "饮料/水",
                            content: {
                                "饮用水": "#饮用水",
                                "碳酸水": "#碳酸水",
                                "中草药饮料": "#中草药饮料",
                                "功能类": "#功能类",
                                "运动类": "#运动类",
                                "茶饮": "#茶饮",
                                "蛋白质类": "#蛋白质类",
                                "果蔬类": "#果蔬类",
                                "果味类": "#果味类"
                            }
                        },
                        {
                            title: "营养冲调",
                            content: {
                                "麦片": "#麦片",
                                "咖啡": "#咖啡",
                                "奶茶": "#奶茶",
                                "蜂蜜": "#蜂蜜",
                                "蜂产品": "#蜂产品",
                                "柚子茶": "#柚子茶",
                                "营养奶粉": "#营养奶粉",
                                "谷粉豆浆": "#谷粉豆浆"
                            }
                        },
                    ],
                },
                {
                    contTypeTitle: "粮油副食",
                    showContItemList: [
                        {
                            title: "食用油",
                            content: {
                                "椰子油": "#椰子油",
                                "橄榄油": "#橄榄油",
                                "调和油": "#调和油",
                                "玉米油": "#玉米油",
                                "葵花籽油": "#葵花籽油",
                                "花生油": "#花生油",
                                "大豆油": "#大豆油",
                                "菜籽油茶": "#菜籽油茶",
                                "油亚麻": "#油亚麻",
                                "籽油": "#籽油",
                            }
                        },
                        {
                            title: "米面/面粉",
                            content: {
                                "东北大米": "#东北大米",
                                "南方籼米": "#南方籼米",
                                "五常大米": "#五常大米",
                                "进口大米": "#进口大米",
                                "稻花香": "#稻花香",
                                "大米": "#大米",
                                "面粉": "#面粉",
                                "挂面": "#挂面"
                            }
                        },
                        {
                            title: "健康杂粮",
                            content: {
                                "小米": "#小米",
                                "红小豆": "#红小豆",
                                "黄豆": "#黄豆",
                                "薏仁米": "#薏仁米",
                                "绿豆": "#绿豆",
                                "黑米": "#黑米",
                                "糯米": "#糯米",
                                "黑芝麻": "#黑芝麻",
                                "杂粮礼盒": "#杂粮礼盒"
                            }
                        },
                        {
                            title: "厨房调味",
                            content: {
                                "方便面": "#方便面",
                                "方便米饭": "#方便米饭",
                                "火腿肠": "#火腿肠",
                                "罐头": "#罐头",
                                "八宝粥": "#八宝粥",
                                "速食汤粥": "#速食汤粥",
                                "麦片谷物": "#麦片谷物",
                                "方便粉丝": "#方便粉丝",
                                "进口方便面": "#进口方便面"
                            }
                        },
                        {
                            title: "方便速食",
                            content: {
                                "酱油": "#酱油",
                                "醋": "#醋",
                                "盐": "#盐",
                                "白糖": "#白糖",
                                "红糖": "#红糖",
                                "烘焙原料": "#烘焙原料",
                                "味精/鸡精": "#味精-鸡精",
                                "复合调味料": "#复合调味料",
                                "香油/芝麻油咖喱": "#香油芝麻油咖喱"
                            }
                        },
                        {
                            title: "南北干货",
                            content: {
                                "木耳": "#木耳",
                                "银耳": "#银耳",
                                "食用菌": "#食用菌",
                                "枸杞": "#枸杞",
                                "大枣": "#大枣",
                                "桂圆干": "#桂圆干",
                                "海干货": "#海干货",
                                "莲子": "#莲子",
                                "水果干": "#水果干"
                            }
                        },
                        {
                            title: "调味酱",
                            content: {
                                "老干妈": "#老干妈",
                                "香辣酱": "#香辣酱",
                                "辣椒酱": "#辣椒酱",
                                "豆瓣酱": "#豆瓣酱",
                                "番茄酱": "#番茄酱",
                                "花生酱": "#花生酱",
                                "香菇酱": "#香菇酱",
                                "拌饭酱": "#拌饭酱",
                                "沙拉酱": "#沙拉酱"
                            }
                        },
                        {
                            title: "地方特产",
                            content: {
                                "宿迁特产": "#宿迁特产",
                                "北京特产": "#北京特产",
                                "上海特产": "#上海特产",
                                "海南特产": "#海南特产",
                                "福建特产": "#福建特产",
                                "山西特产": "#山西特产",
                                "西藏特产": "#西藏特产",
                                "四川特产": "#四川特产",
                                "安徽特产": "#安徽特产"
                            }
                        },
                    ]
                },
                {
                    contTypeTitle: "个人护理",
                    showContItemList: [
                        {
                            title: "洗发护理",
                            content: {
                                "洗发": "#洗发",
                                "护发": "#护发",
                                "染发": "#染发",
                                "造型": "#造型"
                            }
                        },
                        {
                            title: "身体护理",
                            content: {
                                "沐浴": "#沐浴",
                                "男士香水": "#男士香水",
                                "Q版香水": "#Q版香水",
                                "香水套装": "#香水套装"
                            }
                        },
                        {
                            title: "彩妆",
                            content: {
                                "底妆": "#底妆",
                                "眉笔": "#眉笔",
                                "睫毛膏": "#睫毛膏",
                                "眼线": "#眼线",
                                "眼影": "#眼影",
                                "唇膏/彩": "#唇膏-彩",
                                "腮红": "#腮红",
                                "美甲": "#美甲",
                                "美妆工具": "#美妆工具"
                            }
                        },
                        {
                            title: "男士专区",
                            content: {
                                "面部护理": "#面部护理",
                                "洗发护理": "#洗发护理",
                                "身体护理": "#身体护理",
                                "剃须男士": "#剃须男士",
                                "套装": "#套装"
                            }
                        },
                        {
                            title: "美容工具",
                            content: {
                                "化妆工具": "#化妆工具",
                                "美体工具": "#美体工具",
                                "美甲工具": "#美甲工具"
                            }
                        },
                    ]
                },
                {
                    contTypeTitle: "护肤美妆",
                    showContItemList: [
                        {
                            title: "面部护肤",
                            content: {
                                "面膜": "#面膜",
                                "卸妆": "#卸妆",
                                "洁面": "#洁面",
                                "爽肤水": "#爽肤水",
                                "乳液面霜": "#乳液面霜",
                                "精华": "#精华",
                                "眼霜": "#眼霜",
                                "防晒": "#防晒"
                            }
                        },
                        {
                            title: "香水",
                            content: {
                                "女士香水": "#女士香水",
                                "剃须": "#剃须",
                                "润肤": "#润肤",
                                "颈部": "#颈部",
                                "手足": "#手足",
                                "纤体塑形": "#纤体塑形",
                                "美胸": "#美胸"
                            }
                        },
                        {
                            title: "口腔护理",
                            content: {
                                "漱口水": "#漱口水",
                                "牙膏/牙粉": "#牙膏-牙粉",
                                "牙刷/牙线": "#牙刷-牙线"
                            }
                        },
                        {
                            title: "卫生护理",
                            content: {
                                "卫生巾": "#卫生巾",
                                "卫生护垫": "#卫生护垫",
                                "私密护理": "#私密护理"
                            }
                        },
                    ]
                },
                {
                    contTypeTitle: "居家生活",
                    showContItemList: [
                        {
                            title: "五金工具",
                            content: {
                                "花洒头": "#花洒头",
                                "洗衣机龙头": "#洗衣机龙头",
                                "角阀": "#角阀",
                                "地漏": "#地漏",
                                "厨卫挂件": "#厨卫挂件",
                                "接线板": "#接线板",
                                "开关": "#开关",
                                "锁具": "#锁具",
                                "工具": "#工具",
                                "劳保": "#劳保",
                                "家用胶": "#家用胶"
                            }
                        },
                        {
                            title: "简易家具",
                            content: {
                                "书柜书架": "#书柜书架",
                                "衣帽架": "#衣帽架",
                                "层架/置物架": "#层架-置物架",
                                "鞋架": "#鞋架",
                                "简易衣柜": "#简易衣柜",
                                "晾衣架": "#晾衣架",
                                "折叠床": "#折叠床",
                                "家用梯": "#家用梯",
                                "电脑桌休闲椅": "#电脑桌休闲椅"
                            }
                        },
                        {
                            title: "汽车用品",
                            content: {
                                "玻璃水": "#玻璃水",
                                "雨刷": "#雨刷",
                                "香水": "#香水",
                                "洗车配件": "#洗车配件",
                                "毛巾掸子": "#毛巾掸子",
                                "坐垫": "#坐垫",
                                "头枕腰靠": "#头枕腰靠",
                                "挂件摆件": "#挂件摆件"
                            }
                        },
                        {
                            title: "营养保健",
                            content: {
                                "缓解疲劳": "#缓解疲劳",
                                "肝肾养护": "#肝肾养护",
                                "改善睡眠": "#改善睡眠",
                                "补气养血": "#补气养血",
                                "肠胃养护": "#肠胃养护",
                                "调节免疫": "#调节免疫",
                                "调节三高": "#调节三高",
                                "美体塑身": "#美体塑身",
                                "骨骼健康": "#骨骼健康"
                            }
                        },
                        {
                            title: "计生用品",
                            content: {
                                "安全套": "#安全套",
                                "验孕试纸": "#验孕试纸",
                                "排卵试纸": "#排卵试纸",
                                "杜蕾斯": "#杜蕾斯",
                                "杰士邦": "#杰士邦",
                                "冈本": "#冈本",
                                "超薄": "#超薄",
                                "持久": "#持久",
                                "大象": "#大象",
                                "赤尾": "#赤尾"
                            }
                        },
                        {
                            title: "内衣配饰",
                            content: {
                                "男士内裤": "#男士内裤",
                                "女士内裤": "#女士内裤",
                                "文胸": "#文胸",
                                "袜子": "#袜子",
                                "丝袜": "#丝袜",
                                "睡衣": "#睡衣",
                                "保暖内衣": "#保暖内衣",
                                "丝巾": "#丝巾",
                                "帽子": "#帽子",
                                "手套": "#手套"
                            }
                        },
                        {
                            title: "运动户外",
                            content: {
                                "跑步鞋": "#跑步鞋",
                                "篮球鞋": "#篮球鞋",
                                "徒步鞋": "#徒步鞋",
                                "冲锋衣": "#冲锋衣",
                                "羽毛球": "#羽毛球",
                                "篮球": "#篮球",
                                "山地车": "#山地车",
                                "运动配件": "#运动配件",
                                "NB鞋": "#NB鞋"
                            }
                        },
                        {
                            title: "礼品箱包",
                            content: {
                                "拉杆箱": "#拉杆箱",
                                "电脑包": "#电脑包",
                                "双肩包": "#双肩包",
                                "旅行包": "#旅行包",
                                "学生书包": "#学生书包",
                                "打火机": "#打火机",
                                "礼品文具": "#礼品文具",
                                "烟具": "#烟具",
                                "美妆礼品": "#美妆礼品",
                                "闹钟挂钟": "#闹钟挂钟"
                            }
                        },
                        {
                            title: "宠物园艺",
                            content: {
                                "狗粮": "#狗粮",
                                "猫狗窝": "#猫狗窝",
                                "猫粮": "#猫粮",
                                "多肉": "#多肉"
                            }
                        }
                    ]
                },
            ]
        }
    }
});
