/**
 * Created by linpengteng on 2017/5/17.
 */

'use strict';

define(function(){

    var province= {
        "p1": "安徽",
        "p2": "北京",
        "p3": "重庆",
        "p4": "福建",
        "p5": "甘肃",
        "p6": "广东",
        "p7": "广西",
        "p8": "贵州",
        "p9": "海南",
        "p10": "河北",
        "p11": "黑龙江",
        "p12": "河南",
        "p13": "湖北",
        "p14": "湖南",
        "p15": "江苏",
        "p16": "江西",
        "p17": "吉林",
        "p18": "辽宁",
        "p19": "内蒙古",
        "p20": "宁夏",
        "p21": "青海",
        "p22": "山东",
        "p23": "上海",
        "p24": "山西",
        "p25": "陕西",
        "p26": "四川",
        "p27": "天津",
        "p28": "新疆",
        "p29": "西藏",
        "p30": "云南",
        "p31": "浙江",
        "length": 31
    };

    var city= {
        "p1": {
            "cont": "安徽",
            "c1": "合肥",
            "c2": "芜湖",
            "c3": "蚌埠",
            "c4": "淮南",
            "c5": "马鞍山",
            "c6": "淮北",
            "c7": "铜陵",
            "c8": "安庆",
            "c9": "黄山",
            "c10": "滁州",
            "c11": "阜阳",
            "c12": "宿州",
            "c13": "六安",
            "c14": "亳州",
            "c15": "池州",
            "c16": "宣城",
            "length": 16
        },
        "p2": {
            "cont": "北京",
            "c1": "北京",
            "length": 1
        },
        "p3": {
            "cont": "重庆",
            "c1": "重庆",
            "length": 1
        },
        "p4": {
            "cont": "福建",
            "c1": "福州",
            "c2": "厦门",
            "c3": "莆田",
            "c4": "三明",
            "c5": "泉州",
            "c6": "漳州",
            "c7": "南平",
            "c8": "龙岩",
            "c9": "宁德",
            "length": 9
        },
        "p5": {
            "cont": "甘肃",
            "c1": "兰州",
            "c2": "嘉峪关",
            "c3": "金昌",
            "c4": "白银",
            "c5": "天水",
            "c6": "武威",
            "c7": "张掖",
            "c8": "平凉",
            "c9": "酒泉",
            "c10": "庆阳",
            "c11": "定西",
            "c12": "陇南",
            "c13": "临夏",
            "c14": "甘南",
            "length": 14
        },
        "p6": {
            "cont": "广东",
            "c1": "广州",
            "c2": "韶关",
            "c3": "深圳",
            "c4": "珠海",
            "c5": "汕头",
            "c6": "佛山",
            "c7": "江门",
            "c8": "湛江",
            "c9": "茂名",
            "c10": "肇庆",
            "c11": "惠州",
            "c12": "梅州",
            "c13": "汕尾",
            "c14": "河源",
            "c15": "阳江",
            "c16": "清远",
            "c17": "东莞",
            "c18": "中山",
            "c19": "潮州",
            "c20": "揭阳",
            "c21": "云浮",
            "length": 21
        },
        "p7": {
            "cont": "广西",
            "c1": "南宁",
            "c2": "柳州",
            "c3": "桂林",
            "c4": "梧州",
            "c5": "北海",
            "c6": "防城港",
            "c7": "钦州",
            "c8": "贵港",
            "c9": "玉林",
            "c10": "百色",
            "c11": "贺州",
            "c12": "河池",
            "c13": "来宾",
            "c14": "崇左",
            "length": 14
        },
        "p8": {
            "cont": "贵州",
            "c1": "贵阳",
            "c2": "六盘水",
            "c3": "遵义",
            "c4": "安顺",
            "c5": "铜仁",
            "c6": "黔西南",
            "c7": "毕节",
            "c8": "黔东南",
            "c9": "黔南",
            "length": 9
        },
        "p9": {
            "cont": "海南",
            "c1": "海口",
            "c2": "三亚",
            "c3": "三沙",
            "c4": "五指山",
            "c5": "琼海",
            "c6": "儋州",
            "c7": "文昌",
            "c8": "万宁",
            "c9": "东方",
            "c10": "定安",
            "c11": "屯昌",
            "c12": "澄迈",
            "c13": "临高",
            "c14": "白沙",
            "c15": "昌江",
            "c16": "乐东",
            "c17": "陵水",
            "c18": "保亭",
            "c19": "琼中",
            "length": 19
        },
        "p10": {
            "cont": "河北",
            "c1": "石家庄",
            "c2": "唐山",
            "c3": "秦皇岛",
            "c4": "邯郸",
            "c5": "邢台",
            "c6": "保定",
            "c7": "张家口",
            "c8": "承德",
            "c9": "沧州",
            "c10": "廊坊",
            "c11": "衡水",
            "length": 11
        },
        "p11": {
            "cont": "黑龙江",
            "c1": "哈尔滨",
            "c2": "齐齐哈尔",
            "c3": "鸡西",
            "c4": "鹤岗",
            "c5": "双鸭山",
            "c6": "大庆",
            "c7": "伊春",
            "c8": "佳木斯",
            "c9": "七台河",
            "c10": "牡丹江",
            "c11": "黑河",
            "c12": "绥化",
            "c13": "大兴安岭",
            "length": 13
        },
        "p12": {
            "cont": "河南",
            "c1": "郑州",
            "c2": "开封",
            "c3": "洛阳",
            "c4": "平顶山",
            "c5": "安阳",
            "c6": "鹤壁",
            "c7": "新乡",
            "c8": "焦作",
            "c9": "济源",
            "c10": "濮阳",
            "c11": "许昌",
            "c12": "漯河",
            "c13": "三门峡",
            "c14": "南阳",
            "c15": "商丘",
            "c16": "信阳",
            "c17": "周口",
            "c18": "驻马店",
            "length": 18
        },
        "p13": {
            "cont": "湖北",
            "c1": "武汉",
            "c2": "黄石",
            "c3": "十堰",
            "c4": "宜昌",
            "c5": "襄阳",
            "c6": "鄂州",
            "c7": "荆门",
            "c8": "孝感",
            "c9": "荆州",
            "c10": "黄冈",
            "c11": "咸宁",
            "c12": "随州",
            "c13": "恩施",
            "c14": "仙桃",
            "c15": "潜江",
            "c16": "天门",
            "c17": "神农架",
            "length": 17
        },
        "p14": {
            "cont": "湖南",
            "c1": "长沙",
            "c2": "株洲",
            "c3": "湘潭",
            "c4": "衡阳",
            "c5": "邵阳",
            "c6": "岳阳",
            "c7": "常德",
            "c8": "张家界",
            "c9": "益阳",
            "c10": "郴州",
            "c11": "永州",
            "c12": "怀化",
            "c13": "娄底",
            "c14": "湘西",
            "length": 14
        },
        "p15": {
            "cont": "江苏",
            "c1": "南京",
            "c2": "无锡",
            "c3": "徐州",
            "c4": "常州",
            "c5": "苏州",
            "c6": "南通",
            "c7": "连云港",
            "c8": "淮安",
            "c9": "盐城",
            "c10": "扬州",
            "c11": "镇江",
            "c12": "泰州",
            "c13": "宿迁",
            "length": 13
        },
        "p16": {
            "cont": "江西",
            "c1": "南昌",
            "c2": "景德镇",
            "c3": "萍乡",
            "c4": "九江",
            "c5": "新余",
            "c6": "鹰潭",
            "c7": "赣州",
            "c8": "吉安",
            "c9": "宜春",
            "c10": "抚州",
            "c11": "上饶",
            "length": 11
        },
        "p17": {
            "cont": "吉林",
            "c1": "长春",
            "c2": "吉林",
            "c3": "四平",
            "c4": "辽源",
            "c5": "通化",
            "c6": "白山",
            "c7": "松原",
            "c8": "白城",
            "c9": "延边朝鲜族",
            "length": 9
        },
        "p18": {
            "cont": "辽宁",
            "c1": "沈阳",
            "c2": "大连",
            "c3": "鞍山",
            "c4": "抚顺",
            "c5": "本溪",
            "c6": "丹东",
            "c7": "锦州",
            "c8": "营口",
            "c9": "阜新",
            "c10": "辽阳",
            "c11": "盘锦",
            "c12": "铁岭",
            "c13": "朝阳",
            "c14": "葫芦岛",
            "length": 14
        },
        "p19": {
            "cont": "内蒙古",
            "c1": "呼和浩特",
            "c2": "包头",
            "c3": "乌海",
            "c4": "赤峰",
            "c5": "通辽",
            "c6": "鄂尔多斯",
            "c7": "呼伦贝尔",
            "c8": "巴彦淖尔",
            "c9": "乌兰察布",
            "c10": "兴安",
            "c11": "锡林郭勒",
            "c12": "阿拉善",
            "length": 12
        },
        "p20": {
            "cont": "宁夏",
            "c1": "银川",
            "c2": "石嘴山",
            "c3": "吴忠",
            "c4": "固原",
            "c5": "中卫",
            "length": 5
        },
        "p21": {
            "cont": "青海",
            "c1": "西宁",
            "c2": "海东",
            "c3": "海北",
            "c4": "黄南",
            "c5": "海南藏族",
            "c6": "果洛",
            "c7": "玉树",
            "c8": "海西",
            "length": 8
        },
        "p22": {
            "cont": "山东",
            "c1": "济南",
            "c2": "青岛",
            "c3": "淄博",
            "c4": "枣庄",
            "c5": "东营",
            "c6": "烟台",
            "c7": "潍坊",
            "c8": "济宁",
            "c9": "泰安",
            "c10": "威海",
            "c11": "日照",
            "c12": "莱芜",
            "c13": "临沂",
            "c14": "德州",
            "c15": "聊城",
            "c16": "滨州",
            "c17": "菏泽",
            "length": 17
        },
        "p23": {
            "cont": "上海",
            "c1": "上海",
            "length": 1
        },
        "p24": {
            "cont": "山西",
            "c1": "太原",
            "c2": "大同",
            "c3": "阳泉",
            "c4": "长治",
            "c5": "晋城",
            "c6": "朔州",
            "c7": "晋中",
            "c8": "运城",
            "c9": "忻州",
            "c10": "临汾",
            "c11": "吕梁",
            "length": 11
        },
        "p25": {
            "cont": "陕西",
            "c1": "西安",
            "c2": "铜川",
            "c3": "宝鸡",
            "c4": "咸阳",
            "c5": "渭南",
            "c6": "延安",
            "c7": "汉中",
            "c8": "榆林",
            "c9": "安康",
            "c10": "商洛",
            "length": 10
        },
        "p26": {
            "cont": "四川",
            "c1": "成都",
            "c2": "自贡",
            "c3": "攀枝花",
            "c4": "泸州",
            "c5": "德阳",
            "c6": "绵阳",
            "c7": "广元",
            "c8": "遂宁",
            "c9": "内江",
            "c10": "乐山",
            "c11": "南充",
            "c12": "眉山",
            "c13": "宜宾",
            "c14": "广安",
            "c15": "达州",
            "c16": "雅安",
            "c17": "巴中",
            "c18": "资阳",
            "c19": "阿坝",
            "c20": "甘孜",
            "c21": "凉山",
            "length": 21
        },
        "p27": {
            "cont": "天津",
            "length": 1
        },
        "p28": {
            "cont": "新疆",
            "c1": "乌鲁木齐",
            "c2": "克拉玛依",
            "c3": "吐鲁番",
            "c4": "哈密",
            "c5": "昌吉",
            "c6": "博尔塔拉",
            "c7": "巴音郭楞",
            "c8": "阿克苏",
            "c9": "克孜勒苏柯尔克孜",
            "c10": "喀什",
            "c11": "和田",
            "c12": "伊犁",
            "c13": "塔城",
            "c14": "阿勒泰",
            "c15": "石河子",
            "c16": "阿拉尔",
            "c17": "图木舒克",
            "c18": "五家渠",
            "length": 18
        },
        "p29": {
            "cont": "西藏",
            "c1": "拉萨",
            "c2": "昌都",
            "c3": "山南",
            "c4": "日喀则",
            "c5": "那曲",
            "c6": "阿里",
            "c7": "林芝",
            "length": 7
        },
        "p30": {
            "cont": "云南",
            "c1": "昆明",
            "c2": "曲靖",
            "c3": "玉溪",
            "c4": "保山",
            "c5": "昭通",
            "c6": "丽江",
            "c7": "普洱",
            "c8": "临沧",
            "c9": "楚雄",
            "c10": "红河",
            "c11": "文山",
            "c12": "西双版纳",
            "c13": "大理",
            "c14": "德宏",
            "c15": "怒江",
            "c16": "迪庆",
            "length": 16
        },
        "p31": {
            "cont": "浙江",
            "c1": "杭州",
            "c2": "宁波",
            "c3": "温州",
            "c4": "嘉兴",
            "c5": "湖州",
            "c6": "绍兴",
            "c7": "金华",
            "c8": "衢州",
            "c9": "舟山",
            "c10": "台州",
            "c11": "丽水",
            "length": 11
        },
        "length": 362
    };

    var area= {};

    return {
        getProvinceCode: function(str) {
            var provinceCodeList = [];
            if(!str){
                return {
                    "success": false,
                    "msg": "",
                    "obj": null
                };
            }else{
                $.each(province, function(code, name){
                    (str == name) && provinceCodeList.push(code);
                });
                return {
                    "success": true,
                    "msg": "",
                    "obj": {
                        provinceCode: provinceCodeList[0]
                    }
                };
            }
        },

        getProvinceName: function(str) {
            if(!str){
                return {
                    "success": false,
                    "msg": "",
                    "obj": null
                };
            }else{
                return {
                    "success": true,
                    "msg": "",
                    "obj": {
                        provinceName: province[str]
                    }
                };
            }
        },

        getCityCode: function(str) {
            var cityCodeList = [];
            if(!str){
                return {
                    "success": false,
                    "msg": "",
                    "obj": null
                };
            }else{
                $.each(city, function(key, obj){
                    $.each(obj, function(code, name) {
                        (str == name) && (cityCodeList.push(key+"_"+code));
                    })
                });
                return {
                    "success": true,
                    "msg": "",
                    "obj": {
                        cityCode: cityCodeList[0]
                    }
                };
            }
        },

        getCityName: function(str) {
            if(!str){
                return {
                    "success": false,
                    "msg": "",
                    "obj": null
                };
            }else{
                var arr = str.split("_");
                if(arr.length!=2 || !city[arr[0]] || !city[arr[0]][arr[1]]){
                    return {
                        "success": false,
                        "msg": "",
                        "obj": null
                    };
                }else{
                    return {
                        "success": true,
                        "msg": "",
                        "obj": {
                            cityName: city[arr[0]][arr[1]]
                        }
                    };
                }
            }
        }
    }

});
