/**
 * Created by linpengteng on 2017/5/17.
 */

'use strict';

define(function(){

    return {
        //导航模块
        nav: {
            items:[
                {
                    title: "食品饮料",
                    content: {
                        "休闲食品": "#休闲食品",
                        "牛奶": "#牛奶",
                        "饮料": "#饮料",
                        "坚果": "#坚果"
                    },
                    more:{
                        classify:[
                            {
                                title: "进口食品",
                                content: {
                                    "休闲零食1": "#休闲零食1",
                                    "饼干蛋糕": "#饼干蛋糕",
                                    "橄榄油": "#饮料",
                                    "坚果蜜饯": "#坚果蜜饯",
                                    "糖果/巧克力": "#糖果-巧克力",
                                    "进口牛奶": "#进口牛奶",
                                    "方便食品": "#方便食品",
                                    "饮料冲调": "#饮料冲调"
                                }
                            },
                            {
                                title: "休闲食品",
                                content: {
                                    "进口食品": "#进口食品",
                                    "猪肉脯": "#猪肉脯",
                                    "薯片/膨化": "#薯片-膨化",
                                    "鸭脖": "#鸭脖",
                                    "海苔": "#海苔",
                                    "牛肉干": "#牛肉干",
                                    "果蔬干": "#果蔬干",
                                    "果冻": "#果冻",
                                    "辣条": "#辣条"
                                }
                            },
                            {
                                title: "蛋糕饼干",
                                content: {
                                    "进口饼干": "#进口饼干",
                                    "曲奇": "#曲奇",
                                    "面包": "#面包",
                                    "蛋糕饼干": "#蛋糕饼干",
                                    "派蛋卷": "#派蛋卷",
                                    "威化": "#威化",
                                    "肉松饼": "#肉松饼"
                                }
                            },
                            {
                                title: "坚果炒货",
                                content: {
                                    "坚果炒货": "#坚果炒货",
                                    "瓜子": "#瓜子",
                                    "核桃": "#核桃",
                                    "夏威夷果": "#夏威夷果",
                                    "松子": "#松子",
                                    "开心果": "#开心果",
                                    "碧根果": "#碧根果",
                                    "腰果": "#腰果",
                                    "花生": "#花生",
                                }
                            },
                            {
                                title: "蜜饯果干",
                                content: {
                                    "枣夹核桃": "#枣夹核桃",
                                    "枣": "#枣",
                                    "葡萄干": "#葡萄干",
                                    "芒果干": "#芒果干",
                                    "梅": "#梅",
                                    "山楂": "#山楂",
                                    "枸杞": "#枸杞",
                                    "蔓越莓干": "#蔓越莓干",
                                    "栗子薯/芋头类": "#栗子薯-芋头类",
                                }
                            },
                            {
                                title: "糖果/巧克力",
                                content: {
                                    "进口巧克力": "#进口巧克力",
                                    "巧克力": "#巧克力",
                                    "口香糖": "#口香糖",
                                    "棒棒糖": "#棒棒糖",
                                    "喜糖": "#喜糖",
                                    "糖": "#糖",
                                    "润喉糖": "#润喉糖",
                                    "黑巧克力": "#黑巧克力"
                                }
                            },
                            {
                                title: "牛奶",
                                content: {
                                    "进口牛奶": "#进口牛奶",
                                    "牛奶乳品": "#牛奶乳品",
                                    "酸奶": "#酸奶",
                                    "风味奶": "#风味奶",
                                    "儿童奶": "#儿童奶",
                                    "鲜奶": "#鲜奶",
                                    "成人奶粉": "#成人奶粉",
                                    "乳酸饮料": "#乳酸饮料"
                                }
                            },
                            {
                                title: "茗茶",
                                content: {
                                    "铁观音": "#铁观音",
                                    "乌龙茶": "#乌龙茶",
                                    "龙井": "#龙井",
                                    "普洱": "#普洱",
                                    "红茶": "#红茶",
                                    "绿茶": "#绿茶",
                                    "白茶": "#白茶",
                                    "黑茶": "#黑茶",
                                    "养生茶": "#养生茶",
                                    "花果茶": "#花果茶",
                                    "花草茶": "#花草茶"
                                }
                            },
                            {
                                title: "饮料/水",
                                content: {
                                    "饮用水": "#饮用水",
                                    "碳酸水": "#碳酸水",
                                    "中草药饮料": "#中草药饮料",
                                    "功能类": "#功能类",
                                    "运动类": "#运动类",
                                    "茶饮": "#茶饮",
                                    "蛋白质类": "#蛋白质类",
                                    "果蔬类": "#果蔬类",
                                    "果味类": "#果味类"
                                }
                            },
                            {
                                title: "营养冲调",
                                content: {
                                    "麦片": "#麦片",
                                    "咖啡": "#咖啡",
                                    "奶茶": "#奶茶",
                                    "蜂蜜": "#蜂蜜",
                                    "蜂产品": "#蜂产品",
                                    "柚子茶": "#柚子茶",
                                    "营养奶粉": "#营养奶粉",
                                    "谷粉豆浆": "#谷粉豆浆"
                                }
                            },
                        ],
                        recommend:[
                            { "/app/images/test_9.jpg": "#img9" },
                            { "/app/images/test_10.jpg": "#img10" },
                            { "/app/images/test_11.jpg": "#img11" }
                        ]
                    }
                },

                {
                    title: "食品饮料",
                    content: {
                        "休闲食品": "#休闲食品",
                        "牛奶": "#牛奶",
                        "饮料": "#饮料",
                        "坚果": "#坚果"
                    },
                    more:{
                        classify:[
                            {
                                title: "进口食品",
                                content: {
                                    "休闲零食2": "#休闲零食2",
                                    "饼干蛋糕": "#饼干蛋糕",
                                    "橄榄油": "#饮料",
                                    "坚果蜜饯": "#坚果蜜饯",
                                    "糖果/巧克力": "#糖果-巧克力",
                                    "进口牛奶": "#进口牛奶",
                                    "方便食品": "#方便食品",
                                    "饮料冲调": "#饮料冲调"
                                }
                            },
                            {
                                title: "休闲食品",
                                content: {
                                    "进口食品": "#进口食品",
                                    "猪肉脯": "#猪肉脯",
                                    "薯片/膨化": "#薯片-膨化",
                                    "鸭脖": "#鸭脖",
                                    "海苔": "#海苔",
                                    "牛肉干": "#牛肉干",
                                    "果蔬干": "#果蔬干",
                                    "果冻": "#果冻",
                                    "辣条": "#辣条"
                                }
                            },
                            {
                                title: "蛋糕饼干",
                                content: {
                                    "进口饼干": "#进口饼干",
                                    "曲奇": "#曲奇",
                                    "面包": "#面包",
                                    "蛋糕饼干": "#蛋糕饼干",
                                    "派蛋卷": "#派蛋卷",
                                    "威化": "#威化",
                                    "肉松饼": "#肉松饼"
                                }
                            },
                            {
                                title: "坚果炒货",
                                content: {
                                    "坚果炒货": "#坚果炒货",
                                    "瓜子": "#瓜子",
                                    "核桃": "#核桃",
                                    "夏威夷果": "#夏威夷果",
                                    "松子": "#松子",
                                    "开心果": "#开心果",
                                    "碧根果": "#碧根果",
                                    "腰果": "#腰果",
                                    "花生": "#花生",
                                }
                            },
                            {
                                title: "蜜饯果干",
                                content: {
                                    "枣夹核桃": "#枣夹核桃",
                                    "枣": "#枣",
                                    "葡萄干": "#葡萄干",
                                    "芒果干": "#芒果干",
                                    "梅": "#梅",
                                    "山楂": "#山楂",
                                    "枸杞": "#枸杞",
                                    "蔓越莓干": "#蔓越莓干",
                                    "栗子薯/芋头类": "#栗子薯-芋头类",
                                }
                            },
                            {
                                title: "糖果/巧克力",
                                content: {
                                    "进口巧克力": "#进口巧克力",
                                    "巧克力": "#巧克力",
                                    "口香糖": "#口香糖",
                                    "棒棒糖": "#棒棒糖",
                                    "喜糖": "#喜糖",
                                    "糖": "#糖",
                                    "润喉糖": "#润喉糖",
                                    "黑巧克力": "#黑巧克力"
                                }
                            },
                            {
                                title: "牛奶",
                                content: {
                                    "进口牛奶": "#进口牛奶",
                                    "牛奶乳品": "#牛奶乳品",
                                    "酸奶": "#酸奶",
                                    "风味奶": "#风味奶",
                                    "儿童奶": "#儿童奶",
                                    "鲜奶": "#鲜奶",
                                    "成人奶粉": "#成人奶粉",
                                    "乳酸饮料": "#乳酸饮料"
                                }
                            },
                            {
                                title: "茗茶",
                                content: {
                                    "铁观音": "#铁观音",
                                    "乌龙茶": "#乌龙茶",
                                    "龙井": "#龙井",
                                    "普洱": "#普洱",
                                    "红茶": "#红茶",
                                    "绿茶": "#绿茶",
                                    "白茶": "#白茶",
                                    "黑茶": "#黑茶",
                                    "养生茶": "#养生茶",
                                    "花果茶": "#花果茶",
                                    "花草茶": "#花草茶"
                                }
                            },
                            {
                                title: "饮料/水",
                                content: {
                                    "饮用水": "#饮用水",
                                    "碳酸水": "#碳酸水",
                                    "中草药饮料": "#中草药饮料",
                                    "功能类": "#功能类",
                                    "运动类": "#运动类",
                                    "茶饮": "#茶饮",
                                    "蛋白质类": "#蛋白质类",
                                    "果蔬类": "#果蔬类",
                                    "果味类": "#果味类"
                                }
                            },
                            {
                                title: "营养冲调",
                                content: {
                                    "麦片": "#麦片",
                                    "咖啡": "#咖啡",
                                    "奶茶": "#奶茶",
                                    "蜂蜜": "#蜂蜜",
                                    "蜂产品": "#蜂产品",
                                    "柚子茶": "#柚子茶",
                                    "营养奶粉": "#营养奶粉",
                                    "谷粉豆浆": "#谷粉豆浆"
                                }
                            },
                        ],
                        recommend:[
                            { "/app/images/test_9.jpg": "#img9" },
                            { "/app/images/test_10.jpg": "#img10" },
                            { "/app/images/test_11.jpg": "#img11" }
                        ]
                    }
                }

            ],

            bannerImg: [
                { "/app/images/test_1.jpg": "#img1" },
                { "/app/images/test_2.jpg": "#img2" },
                { "/app/images/test_3.jpg": "#img3" },
                { "/app/images/test_4.jpg": "#img4" },
                { "/app/images/test_5.jpg": "#img5" },
                { "/app/images/test_6.jpg": "#img6" }
            ],

            infoImg:[
                { "/app/images/test_7.jpg": "#img7" },
                { "/app/images/test_8.jpg": "#img8" },
                { "/app/images/test_7.jpg": "#img7" },
                { "/app/images/test_8.jpg": "#img8" },
            ]
        }
    }

})
